Show / Hide Table of Contents
Class ConcreteSLSCheckResultStiffness
SLS Check tiffness base
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteSLSCheckResultStiffness
ConcreteSLSCheckResultStiffnessEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ConcreteSLSCheckResultStiffness : ConcreteCheckResultBase
Properties
Improve this Doc   View Source
Fr
crack resistance internal forces
Declaration
public ResultOfInternalForces Fr { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
CharacteristicsI
stiffnesses calculated on uncracked cross-section
Declaration
public SectionCharacteristics CharacteristicsI { get; set; }
Property Value
 Type |  Description
 SectionCharacteristics
Improve this Doc   View Source
CharacteristicsII
stiffnesses calculated on cracked cross-section
Declaration
public SectionCharacteristics CharacteristicsII { get; set; }
Property Value
 Type |  Description
 SectionCharacteristics
Improve this Doc   View Source
LinearStiffness
linear stiffnesses
Declaration
public SectionStiffnesses LinearStiffness { get; set; }
Property Value
 Type |  Description
 SectionStiffnesses
Improve this Doc   View Source
Stiffness
result stiffnesses
Declaration
public SectionStiffnesses Stiffness { get; set; }
Property Value
 Type |  Description
 SectionStiffnesses
Improve this Doc   View Source
StiffnessI
stiffnesses calculated on uncracked cross-section
Declaration
public SectionStiffnesses StiffnessI { get; set; }
Property Value
 Type |  Description
 SectionStiffnesses
Improve this Doc   View Source
StiffnessII
stiffnesses calculated on fully-cracked cross-section
Declaration
public SectionStiffnesses StiffnessII { get; set; }
Property Value
 Type |  Description
 SectionStiffnesses
 Improve this Doc
 View Source